cf_billing/DataProcessors/бестРаботаСДолжникамиЮЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестРаботаСДолжникамиЮЛ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусСогласованияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусСогласованияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСогласованияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкаПериодовЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкаПериодовЗадолженности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>От</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>До</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КатегорияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестКатегорииЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСтатусыСогласованияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСтатусыСогласованияСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТребуетСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетДоработки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСобытие</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСобытия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одинарный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудСудебныйУчастокДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСуды</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанцияДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеИнстанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудьяДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйАктДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСудебногоАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилуДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтветственностиДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргИсполнительнаяОтветственностьПИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособыОтправкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРамкахЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Абоненты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Успех</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бестПараметрыТиповСобытий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПросуженнаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Потребитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГоспошлин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/DataProcessors/бестРаботаСДолжникамиЮЛ/Forms/Форма/Ext/Form/Module.bsl
#Область События_Формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = ТекущаяДата();
	ЗаполнитьЗаголовкиКолонок();
	бестЛокализацияСервер.ПриСозданииНаСервере_бестРаботаСДолжникамиЮЛ(ЭтотОбъект);
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтапыПИР,"Договор", Справочники.энргДоговорыАбонентов.ПустаяСсылка());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗадачиМне,"ТекДата", ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗадачиМне,"ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ОбновитьДокументыКСогласованиюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Команды 

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачатьПИР(Команда)
	Если НЕ ЗначениеЗаполнено(СхемаДляНовыхЗадач) ИЛИ НЕ ЗначениеЗаполнено(НачальныйЭтап) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните схемы для новых задач.");
	Иначе
		Для каждого эл из Элементы.Должники.ВыделенныеСтроки Цикл
			ТекСтрока = Элементы.Должники.ДанныеСтроки(эл);
			ДанныеЗадачи = Новый Структура("Организация, Район, Схема, Договор, КатегорияДебитора, ОбщаяСуммаЗадолженности, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец, ЗадачаЮЛ, Этап"
			,ТекСтрока.Организация, ТекСтрока.Район, СхемаДляНовыхЗадач, ТекСтрока.Договор 
			,ТекСтрока.КатегорияДебитора, ТекСтрока.ОбщаяСуммаЗадолженности, ТекСтрока.ДатаВозникновенияЗадолженности
			,Период, Истина, НачальныйЭтап);
			НачатьПИРНаСервере(ДанныеЗадачи);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыКСогласованию(Команда)
	ОбновитьДокументыКСогласованиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьСобытие(Команда)
	ТекСтрока = Элементы.ДокументыКСогласованию.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		ПоказатьПредупреждение(, "Выберите событие, которое необходимо согласовать");
		Возврат;
	КонецЕсли;
	Если СобытиеСогласовано(ТекСтрока) Тогда 
		ПоказатьПредупреждение(, "Событие уже согласовано");
		Возврат;
	КонецЕсли;
	
	
	ДанныеДляЗаписи = Новый Структура("Организация,Район,ДокРегистратор");
	ЗаполнитьЗначенияСвойств(ДанныеДляЗаписи, ТекСтрока);	
	
	Результат 		= СогласоватьСобытиеНаСервере(ДанныеДляЗаписи);
	ПоказатьПредупреждение(, Результат);

КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработкуСобытие(Команда)
	ТекСтрока = Элементы.ДокументыКСогласованию.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		ПоказатьПредупреждение(, "Выберите событие, которое необходимо согласовать");
		Возврат;
	КонецЕсли; 	
	Если СобытиеСогласовано(ТекСтрока) Тогда 
		ПоказатьПредупреждение(, "Событие уже согласовано");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатЗапросаНаДоработку", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.энргСтатусСогласованияСобытий.Форма.ФормаВернутьНаДоработку",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура АктСверки(Команда)
	ТекДанные = Элементы.Должники.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Отчет.бестАктСверки.Форма.ФормаОтчета",Новый Структура("Организация, Район, Договор", Организация, ТекДанные.Район, ТекДанные.Договор),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ТекДанные = Элементы.Должники.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Договоры = Новый Массив;
	Для каждого эл из Элементы.Должники.ВыделенныеСтроки Цикл
		Договоры.Добавить(Новый Структура("Абонент", Элементы.Должники.ДанныеСтроки(эл).Договор));
	КонецЦикла;                                                         
	
	ОткрытьФорму("Документ.энргСобытие.ФормаОбъекта",Новый Структура("Организация, Район, Договоры, ТипСобытия", Организация, ТекДанные.Район, Договоры, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту")),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьОтборы(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("Группа3", Ложь);
	СтруктураНастроек.Вставить("РазвернутьОтборы", Истина);
	СтруктураНастроек.Вставить("СернутьОтборы", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьОтборы(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("Группа3", Истина);
	СтруктураНастроек.Вставить("РазвернутьОтборы", Ложь);
	СтруктураНастроек.Вставить("СернутьОтборы", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВидыЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа8", Ложь);
	СтруктураНастроек.Вставить("ДолжникиГруппа9", Ложь);
	СтруктураНастроек.Вставить("ДолжникиСвернутьВидыЗадолженности", Ложь);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьВидыЗадолженности", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВидыЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа8", Истина);
	СтруктураНастроек.Вставить("ДолжникиГруппа9", Истина);
	СтруктураНастроек.Вставить("ДолжникиСвернутьВидыЗадолженности", Истина);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьВидыЗадолженности", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьАвансовуюЗадолженность(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа10", Истина);
	СтруктураНастроек.Вставить("ДолжникиГруппа12", Истина);
	СтруктураНастроек.Вставить("ДолжникиСвернутьАвансовуюЗадолженность", Истина);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьАвансовуюЗадолженность", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСрокиЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа4", Истина);
	СтруктураНастроек.Вставить("ДолжникиГруппа5", Истина);
	СтруктураНастроек.Вставить("ДолжникиСвернутьСрокиЗадолженности", Истина);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьСрокиЗадолженности", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьАвансовуюЗадолженность(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа10", Ложь);
	СтруктураНастроек.Вставить("ДолжникиГруппа12", Ложь);
	СтруктураНастроек.Вставить("ДолжникиСвернутьАвансовуюЗадолженность", Ложь);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьАвансовуюЗадолженность", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСрокиЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа4", Ложь);
	СтруктураНастроек.Вставить("ДолжникиГруппа5", Ложь);
	СтруктураНастроек.Вставить("ДолжникиСвернутьСрокиЗадолженности", Ложь);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьСрокиЗадолженности", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьНаСервере()
	Должники.Очистить();
	МВТ = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.бестНастройкаПериодовЗадолженности.ПолучитьКатегорииЗадолженности(МВТ);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = Обработки.бестРаботаСДолжникамиЮЛ.ПолучитьТекстЗапросаДляЗаполнения();
		
	Если ЗначениеЗаполнено(Договор) Тогда
		Запрос.УстановитьПараметр("Договор", Договор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Ссылка = &Договор", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Район) Тогда
		Запрос.УстановитьПараметр("Район", Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "Истина");
	КонецЕсли;

	Если ЗначениеЗаполнено(Ответственный) Тогда
		Запрос.УстановитьПараметр("ОтветственныйЗаДоговор", Ответственный);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.ОтветственныйЗаДоговор = &ОтветственныйЗаДоговор", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		Запрос.УстановитьПараметр("Статус", Статус);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Статус = &Статус", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КатегорияДебитора) Тогда
		Запрос.УстановитьПараметр("КатегорияДебитора", КатегорияДебитора);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НастройкиКатегорийДебитора.КатегорияДебитора = &КатегорияДебитора", "Истина");
	КонецЕсли;

	Если ЗначениеЗаполнено(МинимальнаяСуммаЗадолженностиПени) Тогда
		Запрос.УстановитьПараметр("МинимальнаяСуммаЗадолженностиПени", МинимальнаяСуммаЗадолженностиПени);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Пеня.СуммаОстаток >= &МинимальнаяСуммаЗадолженностиПени", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МинимальнаяСуммаЗадолженности) Тогда
		Запрос.УстановитьПараметр("МинимальнаяСуммаЗадолженности", МинимальнаяСуммаЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МинимальнаяДатаИОбщаяСуммаЗадолженности.СуммаВсего >= &МинимальнаяСуммаЗадолженности", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоДнейЗадолженности) Тогда
		Запрос.УстановитьПараметр("КоличествоДнейЗадолженности", КоличествоДнейЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МинимальнаяДатаИОбщаяСуммаЗадолженности.КолвоДнейЗадолженностиМакс >= &КоличествоДнейЗадолженности", "Истина");
	КонецЕсли;
	
	Если НЕ ИмеетсяТекущаяЗадолженность Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ВТ_ТекущаяЗадолженность.Сумма, 0) > 0", "Истина");
	КонецЕсли;
	
	Если КолвоДнейДоОплатыА = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(СледующаяДатаОплаты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = &КолвоДнейДоОплатыА", "Истина");
	Иначе
		Запрос.УстановитьПараметр("КолвоДнейДоОплатыА", 				КолвоДнейДоОплатыА);
	КонецЕсли;
	
	Если КолвоДнейДоОплатыФ = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(СледующаяДатаОплаты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = &КолвоДнейДоОплатыФ", "Истина");
	Иначе
		Запрос.УстановитьПараметр("КолвоДнейДоОплатыФ", 				КолвоДнейДоОплатыФ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", 				Период);
	Запрос.УстановитьПараметр("НачалоПериода", 			НачалоМесяца(Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Должники.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		НовСтр.IDСтроки 		= Новый УникальныйИдентификатор;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовкиКолонок()
		
	РезультатЗапроса = РегистрыСведений.бестНастройкаПериодовЗадолженности.ПолучитьКатегорииЗадолженности();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.От = 0 Тогда
			ТекстЗаголовок = "Задолженность до " + Выборка.До + " дней";
		ИначеЕсли Выборка.До = 0 Тогда
			ТекстЗаголовок = "Задолженность более " + Выборка.От + " дней";
		Иначе
			ТекстЗаголовок = "Задолженность от " + Выборка.От + " до " + Выборка.До + " дней";
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Должники" + Выборка.КатегорияЗадолженности + "ЗадолженностьСумма", "Заголовок", ТекстЗаголовок);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НачатьПИРНаСервере(ДанныеЗадачи)
	Задачи.энргЗадачаПИД.СоздатьЗадачуПоДанным(ДанныеЗадачи);
КонецПроцедуры

&НаКлиенте
Процедура ДолжникиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Должники.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтапыПИР,"Договор", ПредопределенноеЗначение("Справочник.энргДоговорыАбонентов.ПустаяСсылка"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтапыПИР,"Договор", ТекДанные.Договор);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНачальныйЭтап(СхемаДляНовыхЗадач)
	Если СхемаДляНовыхЗадач.Этапы.Количество() > 0 Тогда
		Возврат СхемаДляНовыхЗадач.Этапы[0].Этап;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивДоступныхОпераций(СхемаДляНовыхЗадач)
	мОпераций = Новый Массив;
	Для каждого эл из СхемаДляНовыхЗадач.Этапы Цикл
		мОпераций.Добавить(эл.Этап);
	КонецЦикла;
	Возврат мОпераций;
КонецФункции

&НаКлиенте
Процедура НастроитьВидимостьЭлементов(СтруктураНастроек)
	Для каждого эл из СтруктураНастроек Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, эл.Ключ, "Видимость", эл.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы 

&НаКлиенте
Процедура СхемаДляНовыхЗадачПриИзменении(Элемент)
	НачальныйЭтап = ПолучитьНачальныйЭтап(СхемаДляНовыхЗадач);
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиМнеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		ПарамФормы = Новый Структура("Ключ", ВыбраннаяСтрока);
		ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачальныйЭтапНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ФормаВыбора 			= ПолучитьФорму("Справочник.энргВидыОперацийПИД.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список,"Ссылка", ПолучитьМассивДоступныхОпераций(СхемаДляНовыхЗадач), ВидСравненияКомпоновкиДанных.ВСписке);
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ДолжникиОбщаяСуммаЗадолженности" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаЗадолженности",Новый Структура("Организация, Район, Договор, НачалоПериода", Организация, ТекДанные.Район, ТекДанные.Договор, ТекДанные.ДатаВозникновенияЗадолженности),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиСуммаПени" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаПени",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиРеструктуризированнаяЗадолженность" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаРеструктуризированнойЗадолженности",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиБезнадежнаяЗадолженность" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаБезнадежнойЗадолженности",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиМораторнаяЗадолженность" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаМораторнойЗадолженности",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПереносСФизиков 

&НаСервере
Процедура ОбновитьДокументыКСогласованиюНаСервере()
	ДокументыКСогласованию.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтатусСогласованияСобытийСрезПоследних.Организация КАК Организация,
		|	энргСтатусСогласованияСобытийСрезПоследних.Район КАК Район,
		|	энргСтатусСогласованияСобытийСрезПоследних.ДокРегистратор КАК ДокРегистратор,
		|	энргСтатусСогласованияСобытийСрезПоследних.Статус КАК Статус,
		|	энргСтатусСогласованияСобытийСрезПоследних.Исполнитель КАК Исполнитель,
		|	энргСтатусСогласованияСобытийСрезПоследних.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ СтатусыСобытий
		|ИЗ
		|	РегистрСведений.энргСтатусСогласованияСобытий.СрезПоследних(&Период, ) КАК энргСтатусСогласованияСобытийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
		|		ПО энргСтатусСогласованияСобытийСрезПоследних.ДокРегистратор = энргСобытиеАбоненты.Ссылка
		|ГДЕ
		|	энргСобытиеАбоненты.Абонент ССЫЛКА Справочник.энргДоговорыКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыСобытий.Организация КАК Организация,
		|	СтатусыСобытий.Район КАК Район,
		|	СтатусыСобытий.ДокРегистратор КАК ДокРегистратор,
		|	СтатусыСобытий.Статус КАК Статус,
		|	СтатусыСобытий.Комментарий КАК Комментарий
		|ИЗ
		|	СтатусыСобытий КАК СтатусыСобытий
		|ГДЕ
		|	СтатусыСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.энргСтатусыСогласованияСобытий.Согласовано)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусыСобытий.Организация,
		|	СтатусыСобытий.Район,
		|	СтатусыСобытий.ДокРегистратор,
		|	СтатусыСобытий.Статус,
		|	СтатусыСобытий.Комментарий
		|ИЗ
		|	СтатусыСобытий КАК СтатусыСобытий
		|ГДЕ
		|	НЕ СтатусыСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.энргСтатусыСогласованияСобытий.Согласовано)
		|	И СтатусыСобытий.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	Запрос.УстановитьПараметр("Исполнитель"	, Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НСтрока = ДокументыКСогласованию.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла; 	
КонецПроцедуры

&НаСервере
Функция СогласоватьСобытиеНаСервере(ДанныеДляЗаписи)
	ТекстУспеха				= "Статус успешно зарегистрирован";	
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= ДанныеДляЗаписи.Организация;
	ОписаниеОжидаемыхДанных.Район 			= ДанныеДляЗаписи.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= ДанныеДляЗаписи.ДокРегистратор;
	ОписаниеОжидаемыхДанных.Исполнитель 	= Пользователи.ТекущийПользователь();
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.Согласовано;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		ОбновитьДокументыКСогласованиюНаСервере();
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция СобытиеСогласовано(ТекСтрока)
	Возврат ТекСтрока.Статус = ПредопределенноеЗначение("Перечисление.энргСтатусыСогласованияСобытий.Согласовано");
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗапросаНаДоработку(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	          	
	ТекСтрока 				= Элементы.ДокументыКСогласованию.ТекущиеДанные;
	ДанныеДляЗаписи 		= Новый Структура("Организация,Район,ДокРегистратор");
	ЗаполнитьЗначенияСвойств(ДанныеДляЗаписи, ТекСтрока); 	
	РезультатСменыСтатуса 	= ВернутьНаДоработкуСобытиеНаСервере(ДанныеДляЗаписи, Результат);
	ПоказатьПредупреждение(, РезультатСменыСтатуса);
КонецПроцедуры

&НаСервере
Функция ВернутьНаДоработкуСобытиеНаСервере(ДанныеДляЗаписи, СтруктураОтвета)
	ТекстУспеха				= "Статус успешно зарегистрирован";	
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= ДанныеДляЗаписи.Организация;
	ОписаниеОжидаемыхДанных.Район 			= ДанныеДляЗаписи.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= ДанныеДляЗаписи.ДокРегистратор;
	ОписаниеОжидаемыхДанных.Исполнитель 	= СтруктураОтвета.Исполнитель;
	ОписаниеОжидаемыхДанных.Комментарий 	= СтруктураОтвета.Комментарий;
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.ТребуетДоработки;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		ОбновитьДокументыКСогласованиюНаСервере();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
